Repository: akuppa01/mittiai
Catalog: lib/l10n/app_*.arb
Languages: te

# greetingWithName
source: Hi {userName}, your farming assistant is here to help.
te: నమస్కారం {userName}, మీ కిసాన్ సహాయకుడు మీకు సహాయం చేయడానికి ఇక్కడ ఉన్నారు.

# stateLabel
source: State
te: రాష్ట్రం

# stateHint
source: Select your state
te: మీ రాష్ట్రాన్ని ఎంచుకోండి

# stateValidationError
source: Please select your state
te: దయచేసి మీ రాష్ట్రాన్ని ఎంచుకోండి

# formValidationError
source: Please fill all required fields and make selections.
te: దయచేసి అన్ని అవసరమైన ఫీల్డ్‌లను పూరించండి మరియు ఎంపికలు చేయండి.

# profileUserDetailsLabel
source: User Details
te: వినియోగదారు వివరాలు

# profileNameLabel
source: Name
te: పేరు

# profileVillageLabel
source: Village
te: గ్రామం

# profileEmailLabel
source: Email
te: ఇమెయిల్

# profilePhoneLabel
source: Phone
te: ఫోన్

# profileCropTypeLabel
source: Crop Type
te: పంట రకం

# languageSettingsLabel
source: Language Settings
te: భాషా సెట్టింగ్‌లు

# languageDropdownLabel
source: Select Language
te: భాషను ఎంచుకోండి

# loginButtonLabel
source: Login / Complete Profile
te: లాగిన్ / ప్రొఫైల్ పూర్తి చేయండి

# agriAssistantTagline
source: Your agri assistant is here to help
te: మీ కిసాన్ సహాయకుడు మీకు సహాయం చేయడానికి ఇక్కడ ఉన్నారు.

# greetingWithoutName
source: Your farming assistant is here to help.
te: మీ కిసాన్ సహాయకుడు మీకు సహాయం చేయడానికి ఇక్కడ ఉన్నారు.

# voiceAssistantTitle
source: Voice Assistant
te: వాయిస్ అసిస్టెంట్

# profileTitle
source: Profile
te: ప్రొఫైల్

# remindersTitle
source: Reminders
te: రిమైండర్‌లు

# infoLibraryTitle
source: Library
te: లైబ్రరీ

# schemesTitle
source: Schemes
te: పథకాలు

# assistantNavLabel
source: Assistant
te: సహాయకుడు

# remindersNavLabel
source: Reminders
te: రిమైండర్‌లు

# infoNavLabel
source: Info
te: సమాచారం

# schemesNavLabel
source: Schemes
te: పథకాలు

# profileNavLabel
source: Profile
te: ప్రొఫైల్

# languageLabel
source: Language
te: భాష

# logoutButton
source: Log out
te: లాగ్ అవుట్ చేయండి

# setupScreenTitle
source: Welcome to Mitti AI!
te: మిట్టి ఏఐకి స్వాగతం!

# setupScreenSubtitle
source: Let's get your agricultural assistant ready.
te: మీ వ్యవసాయ సహాయకుడిని సిద్ధం చేద్దాం.

# nameLabel
source: Your Name
te: మీ పేరు

# nameHint
source: Enter your full name
te: మీ పూర్తి పేరు నమోదు చేయండి

# nameValidationError
source: Please enter your name
te: దయచేసి మీ పేరు నమోదు చేయండి

# villageLabel
source: Your Village/Town
te: మీ గ్రామం/పట్టణం

# villageHint
source: Enter the name of your village or town
te: మీ గ్రామం లేదా పట్టణం పేరు నమోదు చేయండి

# villageValidationError
source: Please enter your village/town
te: దయచేసి మీ గ్రామం/పట్టణం నమోదు చేయండి

# emailOptionalLabel
source: Email (Optional)
te: ఇమెయిల్ (ఐచ్ఛికం)

# emailHint
source: Your email username
te: మీ ఇమెయిల్ యూజర్‌నేమ్

# emailInvalidError
source: Please enter a valid email address
te: దయచేసి చెల్లుబాటు అయ్యే ఇమెయిల్ చిరునామాను నమోదు చేయండి

# languageHint
source: Select your language
te: మీ భాషను ఎంచుకోండి

# languageValidationError
source: Please select a language
te: దయచేసి ఒక భాషను ఎంచుకోండి

# saveAndContinueButton
source: Save & Continue
te: సేవ్ చేసి కొనసాగించండి

# skipButton
source: Skip for now
te: ప్రస్తుతానికి దాటవేయి

# voiceAssistantHelpPrompt
source: What can I help you with today?
te: ఈ రోజు నేను మీకు ఎలా సహాయపడగలను?

# tapToSpeakButton
source: Tap to Speak
te: మాట్లాడటానికి నొక్కండి

# pleaseWaitMessage
source: Please wait...
te: దయచేసి వేచి ఉండండి...

# tryAgainLater
source: Please try again later.
te: దయచేసి తర్వాత మళ్లీ ప్రయత్నించండి.

# noMessagesYetLabel
source: No messages yet
te: ఇంకా సందేశాలు లేవు.

# upcomingRemindersTitle
source: Upcoming Reminders
te: రాబోయే రిమైండర్‌లు

# timeLabel
source: Time
te: సమయం

# dateLabel
source: Date
te: తేదీ

# addReminderFAB
source: Add Reminder
te: రిమైండర్ జోడించు

# noReminders
source: No reminders set yet.
te: ఇంకా రిమైండర్‌లు సెట్ చేయబడలేదు.

# saveReminderButton
source: Save Reminder
te: రిమైండర్‌ను సేవ్ చేయండి

# homeNavLabel
source: Home
te: హోమ్

# askYourDoubtsPrompt
source: Ask your doubts regarding agriculture
te: వ్యవసాయ సంబంధిత సందేహాలను అడగండి

# quickAccessTitle
source: Quick Access
te: త్వరిత యాక్సెస్

# historyTitle
source: History
te: చరిత్ర

# libraryNavLabel
source: Library
te: లైబ్రరీ

# weatherNavLabel
source: Weather
te: వాతావరణం

# tipOfTheDayTitle
source: Tip of the Day
te: ఈ రోజు చిట్కా

# tipOfTheDay1
source: Rotate your crops to improve soil health and reduce pests.
te: మట్టి ఆరోగ్యాన్ని మెరుగుపరచడానికి మరియు తెగుళ్ళను తగ్గించడానికి మీ పంటలను మార్చండి.

# tipOfTheDay2
source: Regularly check your plants for early signs of diseases.
te: వ్యాధుల ప్రారంభ సంకేతాల కోసం మీ మొక్కలను క్రమం తప్పకుండా తనిఖీ చేయండి.

# tipOfTheDay3
source: Ensure your irrigation system is efficient to save water.
te: నీటిని ఆదా చేయడానికి మీ నీటిపారుదల వ్యవస్థ సమర్థవంతంగా ఉందని నిర్ధారించుకోండి.

# voiceInputNotImplemented
source: Voice input not implemented yet.
te: వాయిస్ ఇన్‌పుట్ ఇంకా అమలు కాలేదు.

# speakCommandToSearch
source: Tap the mic and speak your query.
te: మైక్‌ని నొక్కి మీ ప్రశ్నను మాట్లాడండి.

# remindersAppBarTitle
source: Reminders
te: రిమైండర్‌లు

source: No reminders yet.
te: ఇంకా రిమైండర్‌లు లేవు.

# tapPlusToAddReminder
source: Tap the + button to add a new reminder.
te: కొత్త రిమైండర్‌ను జోడించడానికి + బటన్‌ను నొక్కండి.

# addReminderTooltip
source: Add Reminder
te: రిమైండర్‌ను జోడించు

# dueOn
source: Due on {date}
te: {date} నాడు గడువు

source: Repeats daily
te: ప్రతిరోజూ పునరావృతమవుతుంది

# repeatsWeeklyOn
source: Repeats weekly on {days}
te: {days} వారానికోసారి పునరావృతమవుతుంది

source: Repeats weekly
te: వారానికోసారి పునరావృతమవుతుంది

# repeatsMonthlyOnDay
source: Repeats monthly on day {day}
te: నెలవారీగా {day}వ తేదీన పునరావృతమవుతుంది

source: Repeats monthly
te: నెలవారీగా పునరావృతమవుతుంది

# addReminderDialogTitle
source: Add New Reminder
te: కొత్త రిమైండర్‌ను జోడించండి

# reminderNameHint
source: Enter reminder name
te: రిమైండర్ పేరును నమోదు చేయండి

# fieldRequiredErrorText
source: This field is required
te: ఈ ఫీల్డ్ అవసరం

# selectDatePrompt
source: Select a date
te: తేదీని ఎంచుకోండి

# selectTimePrompt
source: Select a time
te: సమయాన్ని ఎంచుకోండి

# repeatLabel
source: Repeat
te: పునరావృతం చేయండి

# repeatNone
source: None
te: ఏదీ కాదు

# selectDaysOfWeekPrompt
source: Select days of the week:
te: వారంలోని రోజులను ఎంచుకోండి:

# selectDayOfMonthPrompt
source: Select day of the month:
te: నెలలోని రోజును ఎంచుకోండి:

# addButtonLabel
source: Add
te: జోడించు

# ensureTitleDateAndTime
source: Please ensure title, date, and time are set.
te: దయచేసి శీర్షిక, తేదీ మరియు సమయం సెట్ చేయబడిందని నిర్ధారించుకోండి.

# repeatDaily
source: Repeats daily
te: రోజువారీ

# repeatWeekly
source: Repeats weekly
te: వారంవారీ

# repeatMonthly
source: Repeats monthly
te: నెలవారీ

# speakingNowPrompt
source: Listening... Speak now
te: వింటున్నాను... ఇప్పుడు మాట్లాడండి

# stopLabel
source: Stop
te: ఆపు

# closeLabel
source: Close
te: మూసివేయి

# processingLabel
source: Processing...
te: ప్రాసెస్ అవుతోంది...

# schemesScreenTitle
source: Government Schemes
te: ప్రభుత్వ పథకాలు

# schemesScreenSelectStateHint
source: Select State
te: రాష్ట్రం ఎంచుకోండి

# schemesScreenSelectDistrictHint
source: Select District
te: జిల్లా ఎంచుకోండి

# schemesScreenFetchingSchemes
source: Fetching schemes...
te: పథకాలు పొందుపరచబడుతున్నాయి...

# schemesScreenErrorPrefix
source: Error:
te: లోపం:

# schemesScreenNoSchemesAvailable
source: No schemes available for the selected state/district.
te: ఎంచుకున్న రాష్ట్రం/జిల్లాకు పథకాలు అందుబాటులో లేవు.

# schemeDialogViewSourceButton
source: View Source
te: మూలాన్ని వీక్షించండి

# schemeDialogCloseButton
source: Close
te: మూసివేయండి

# schemeDialogCouldNotLaunchPrefix
source: Could not launch
te: ప్రారంభించడం సాధ్యపడలేదు

# schemesScreenLoginPrompt
source: Login and select your state to view state-specific schemes.
te: రాష్ట్ర-నిర్దిష్ట పథకాలను వీక్షించడానికి లాగిన్ చేసి, మీ రాష్ట్రాన్ని ఎంచుకోండి.

# schemesScreenLoginButton
source: Login
te: లాగిన్ చేయండి

# schemesScreenUpdatingSchemes
source: Updating schemes… (this may take 10–20s). Please wait.
te: పథకాలు నవీకరించబడుతున్నాయి... (దీనికి 10–20 సెకన్లు పట్టవచ్చు). దయచేసి వేచి ఉండండి.

# schemeDialogOpenWebsite
source: Open website for more details.
te: మరిన్ని వివరాల కోసం వెబ్‌సైట్ తెరవండి.

# schemeDialogStepsLabel
source: Steps:
te: దశలు:

# schemeDialogDocumentsLabel
source: Documents:
te: పత్రాలు:

# schemesScreenNoSchemesForState
source: No schemes found for {stateName}. Try refreshing, or check back later.
te: {stateName} కొరకు పథకాలు కనుగొనబడలేదు. దయచేసి రిఫ్రెష్ చేయండి, లేదా తర్వాత తనిఖీ చేయండి.

# historyScreenTitle
source: History
te: హిస్టరీ

# clearHistoryDialogTitle
source: Clear history?
te: హిస్టరీను క్లియర్ చేయాలా?

# clearHistoryDialogContent
source: Delete all saved chats?
te: సేవ్ చేసిన అన్ని చాట్‌లను తొలగించాలా?

# cancelButtonLabel
source: Cancel
te: రద్దు చేయి

# clearButtonLabel
source: Clear
te: క్లియర్ చేయి

source: No recent chats
te: ఇటీవలి చాట్‌లు లేవు

# refreshLabel
source: Refresh
te: రిఫ్రెష్ చేయండి

# searchHint
source: Search...
te: వెతకండి...

# noLibraryItemsMessage
source: No library items found. Pull down to refresh or try a different search.
te: లైబ్రరీ అంశాలు కనుగొనబడలేదు. రిఫ్రెష్ చేయడానికి క్రిందికి లాగండి లేదా వేరే శోధనను ప్రయత్నించండి。

# categorySeeds
source: Seeds
te: విత్తనాలు

# categoryFertilizers
source: Fertilizers
te: ఎరువులు

# categoryPestsAndDiseases
source: Pests & Diseases
te: తెగుళ్లు & వ్యాధులు

# microphonePermissionDeniedPreviously
source: Microphone permission was denied. Please grant it to use this feature.
te: మైక్రోఫోన్ అనుమతి నిరాకరించబడింది. దయచేసి ఈ ఫీచర్‌ను ఉపయోగించడానికి అనుమతి ఇవ్వండి.

# grantPermissionAction
source: Grant
te: అనుమతించు

# microphonePermissionPermanentlyDenied
source: Microphone permission is permanently denied. Please enable it in app settings.
te: మైక్రోఫోన్ అనుమతి శాశ్వతంగా నిరాకరించబడింది. దయచేసి యాప్ సెట్టింగ్‌లలో దాన్ని ప్రారంభించండి.

# openSettingsAction
source: Open Settings
te: సెట్టింగ్‌లను తెరువు

# microphonePermissionNeeded
source: Microphone permission is required to use voice input.
te: వాయిస్ ఇన్‌పుట్ ఉపయోగించడానికి మైక్రోఫోన్ అనుమతి అవసరం.

# microphonePermissionRestricted
source: Microphone access is restricted on this device.
te: ఈ పరికరంలో మైక్రోఫోన్ యాక్సెస్ నియంత్రించబడింది.

# speechNotAvailable
source: Speech recognition is not available.
te: స్పీచ్ రికగ్నిషన్ అందుబాటులో లేదు.

# calendarPermissionNeededMessage
source: To save reminders, the app needs permission to access your calendar.
te: రిమైండర్‌లను సేవ్ చేయడానికి, యాప్‌కి మీ క్యాలెండర్‌ను యాక్సెస్ చేయడానికి అనుమతి అవసరం.

# calendarPermissionDeniedMessage
source: Calendar permission was denied. Please grant access to create reminders.
te: క్యాలెండర్ అనుమతి నిరాకరించబడింది. దయచేసి రిమైండర్‌లను సృష్టించడానికి యాక్సెస్ ఇవ్వండి.

# calendarPermissionPermanentlyDeniedMessage
source: Calendar permission is permanently denied. Please go to settings to enable it if you want to create reminders.
te: క్యాలెండర్ అనుమతి శాశ్వతంగా నిరాకరించబడింది. మీరు రిమైండర్‌లను సృష్టించాలనుకుంటే దయచేసి దాన్ని ప్రారంభించడానికి సెట్టింగ్‌లకు వెళ్లండి.

# calendarPermissionRestrictedMessage
source: Calendar access is restricted on this device. Reminders cannot be saved.
te: ఈ పరికరంలో క్యాలెండర్ యాక్సెస్ నియంత్రించబడింది. రిమైండర్‌లు సేవ్ చేయబడవు.

# okAction
source: OK
te: సరే

# phoneLabel
source: Phone Number
te: ఫోన్ నంబర్

# phoneValidationError
source: Please enter your phone number
te: దయచేసి మీ ఫోన్ నంబర్‌ను నమోదు చేయండి

# phoneInvalidError
source: Phone number must be 10 digits
te: ఫోన్ నంబర్ తప్పనిసరిగా 10 అంకెలు ఉండాలి

# cropTypeLabel
source: Crop Type
te: పంట రకం

# cropTypeHint
source: e.g., Wheat, Rice
te: ఉదా., గోధుమ, బియ్యం

# cropTypeValidationError
source: Crop type must be at least 3 characters long
te: పంట రకం తప్పనిసరిగా కనీసం 3 అక్షరాలు ఉండాలి

# privacyPolicyLabel
source: Privacy Policy
te: గోప్యతా విధానం

# privacyPolicyError
source: Could not open privacy policy.
te: గోప్యతా విధానాన్ని తెరవలేకపోయాము.

# privacyPolicyTitle
source: Privacy Policy
te: గోప్యతా విధానం

# acceptAndContinueButton
source: Accept and Continue
te: ఆమోదించి కొనసాగించు

# supportText
source: Support:
te: మద్దతు:

# supportMessage
source: Any queries/support, follow the above link.
te: ఏవైనా ప్రశ్నలు/మద్దతు కోసం, పై లింక్ ని అనుసరించండి.

# emailError
source: Could not open email app.
te: ఇమెయిల్ యాప్‌ను తెరవలేకపోయాము.

# urlLaunchError
source: Could not open support page.
te: మద్దతు పేజీని తెరవలేకపోయాము.

# mittiAiSupportLink
source: Mitti AI Support
te: మిట్టి AI మద్దతు
